GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/applications/jt808.c
/************************************************************
 * Copyright (C), 2008-2012,
 * FileName:		// 文件名
 * Author:			// 作者
 * Date:			// 日期
 * Description:		// 模块描述
 * Version:			// 版本信息
 * Function List:	// 主要函数及其功能
 *     1. -------
 * History:			// 历史修改记录
 *     <author>  <time>   <version >   <desc>
 *     David    96/10/12     1.0     build this moudle
 ***********************************************************/
#include <stdio.h>

#include <board.h>
#include <rtthread.h>
#include <finsh.h>

#include "stm32f4xx.h"
#include "gsm.h"
#include "jt808.h"
#include "msglist.h"
#include "jt808_sprintf.h"
#include "sst25.h"

#include "pt.h"

#include "tree_config.h"

#define ByteSwap2( val )    \
    ( ( ( val & 0xff ) << 8 ) |   \
      ( ( val & 0xff00 ) >> 8 ) )

#define ByteSwap4( val )    \
    ( ( ( val & 0xff ) << 24 ) |   \
      ( ( val & 0xff00 ) << 8 ) |  \
      ( ( val & 0xff0000 ) >> 8 ) |  \
      ( ( val & 0xff000000 ) >> 24 ) )

typedef struct
{
	uint16_t id;
	int ( *func )( JT808_RX_MSG_NODEDATA* nodedata );
}HANDLE_JT808_RX_MSG;

static struct rt_mailbox	mb_gprsdata;
#define MB_GPRSDATA_POOL_SIZE 32
static uint8_t				mb_gprsdata_pool[MB_GPRSDATA_POOL_SIZE];

static struct rt_mailbox	mb_gpsdata;
#define MB_GPSDATA_POOL_SIZE 32
static uint8_t				mb_gpsdata_pool[MB_GPSDATA_POOL_SIZE];

uint32_t					jt808_alarm		= 0x0;
uint32_t					jt808_status	= 0x0;

static uint16_t				tx_seq = 0; /*发送序号*/

static rt_device_t			pdev_gsm = RT_NULL;

static struct pt			pt_jt808_socket;

/*发送信息列表*/
MsgList* list_jt808_tx;

/*接收信息列表*/
MsgList		* list_jt808_rx;

T_GPSINFO	gpsinfo;

GSM_SOCKET	gsm_socket[MAX_GSM_SOCKET];

GSM_SOCKET	curr_gsm_socket;

JT808_PARAM jt808_param =
{
	0x13022200,         /*0x0000 版本*/
	5,                  /*0x0001 心跳发送间隔*/
	5,                  /*0x0002 TCP应答超时时间*/
	3,                  /*0x0003 TCP超时重传次数*/
	3,                  /*0x0004 UDP应答超时时间*/
	5,                  /*0x0005 UDP超时重传次数*/
	3,                  /*0x0006 SMS消息应答超时时间*/
	5,                  /*0x0007 SMS消息重传次数*/
	"CMNET",            /*0x0010 主服务器APN*/
	"",                 /*0x0011 用户名*/
	"",                 /*0x0012 密码*/
	"60.28.50.210",     /*0x0013 主服务器地址*/
	"CMNET",            /*0x0014 备份APN*/
	"",                 /*0x0015 备份用户名*/
	"",                 /*0x0016 备份密码*/
	"www.google.com",   /*0x0017 备份服务器地址，ip或域名*/
	9131,               /*0x0018 TCP端口*/
	5678,               /*0x0019 UDP端口*/
	"",                 /*0x001A ic卡主服务器地址，ip或域名*/
	0,                  /*0x001B ic卡服务器TCP端口*/
	0,                  /*0x001C ic卡服务器UDP端口*/
	"",                 /*0x001D ic卡备份服务器地址，ip或域名*/
	0,                  /*0x0020 位置汇报策略*/
	1,                  /*0x0021 位置汇报方案*/
	30,                 /*0x0022 驾驶员未登录汇报时间间隔*/
	120,                /*0x0027 休眠时汇报时间间隔*/
	5,                  /*0x0028 紧急报警时汇报时间间隔*/
	30,                 /*0x0029 缺省时间汇报间隔*/
	500,                /*0x002c 缺省距离汇报间隔*/
	1000,               /*0x002d 驾驶员未登录汇报距离间隔*/
	1000,               /*0x002e 休眠时距离汇报间隔*/
	100,                /*0x002f 紧急时距离汇报间隔*/
	270,                /*0x0030 拐点补传角度*/
	500,                /*0x0031 电子围栏半径（非法位移阈值），单位为米*/
	"1008611",          /*0x0040 监控平台电话号码*/
	"",                 /*0x0041 复位电话号码*/
	"",                 /*0x0042 恢复出厂设置电话号码*/
	"",                 /*0x0043 监控平台SMS号码*/
	"",                 /*0x0044 接收终端SMS文本报警号码*/
	5,                  /*0x0045 终端接听电话策略*/
	3,                  /*0x0046 每次通话时长*/
	3,                  /*0x0047 当月通话时长*/
	"",                 /*0x0048 监听电话号码*/
	"",                 /*0x0049 监管平台特权短信号码*/
	5,                  /*0x0050 报警屏蔽字*/
	3,                  /*0x0051 报警发送文本SMS开关*/
	5,                  /*0x0052 报警拍照开关*/
	3,                  /*0x0053 报警拍摄存储标志*/
	5,                  /*0x0054 关键标志*/
	3,                  /*0x0055 最高速度kmh*/
	5,                  /*0x0056 超速持续时间*/
	3,                  /*0x0057 连续驾驶时间门限*/
	5,                  /*0x0058 当天累计驾驶时间门限*/
	3,                  /*0x0059 最小休息时间*/
	5,                  /*0x005A 最长停车时间*/
	900,                /*0x0005B 超速报警预警差值，单位为 1/10Km/h */
	90,                 /*0x005C 疲劳驾驶预警差值，单位为秒（s），>0*/
	0x200a,             /*0x005D 碰撞报警参数设置:*/
	30,                 /*0x005E 侧翻报警参数设置： 侧翻角度，单位 1 度，默认为 30 度*/
	0,                  /*0x0064 定时拍照控制*/
	0,                  /*0x0065 定距拍照控制*/
	3,                  /*0x0070 图像视频质量(1-10)*/
	5,                  /*0x0071 亮度*/
	3,                  /*0x0072 对比度*/
	5,                  /*0x0073 饱和度*/
	3,                  /*0x0074 色度*/
	5,                  /*0x0080 车辆里程表读数0.1km*/
	3,                  /*0x0081 省域ID*/
	5,                  /*0x0082 市域ID*/
	"津O-00001",        /*0x0083 机动车号牌*/
	1,                  /*0x0084 车牌颜色  1蓝色 2黄色 3黑色 4白色 9其他*/
	0x0f,               /*0x0090 GNSS 定位模式*/
	0x01,               /*0x0091 GNSS 波特率*/
	0x01,               /*0x0092 GNSS 模块详细定位数据输出频率*/
	0x01,               /*0x0093    GNSS 模块详细定位数据采集频率*/
	0x01,               /*0x0094    GNSS 模块详细定位数据上传方式*/
	0x01,               /*0x0095 GNSS 模块详细定位数据上传设置*/
	0,                  /*0x0100 CAN 总线通道 1 采集时间间隔(ms)，0 表示不采集*/
	0,                  /*0x0101 CAN 总线通道 1 上传时间间隔(s)，0 表示不上传*/
	0,                  /*0x0102 CAN 总线通道 2 采集时间间隔(ms)，0 表示不采集*/
	0,                  /*0x0103 CAN 总线通道 2 上传时间间隔(s)，0 表示不上传*/
	{ 0, 0 },           /*0x0110 CAN 总线 ID 单独采集设置*/
	{ 0, 0 },           /*0x0111 其他CAN 总线 ID 单独采集设置*/
	{ 0, 0 },           /*0x0112 其他CAN 总线 ID 单独采集设置*/
	{ 0, 0 },           /*0x0113 其他CAN 总线 ID 单独采集设置*/
	{ 0, 0 },           /*0x0114 其他CAN 总线 ID 单独采集设置*/
	{ 0, 0 },           /*0x0115 其他CAN 总线 ID 单独采集设置*/
	{ 0, 0 },           /*0x0116 其他CAN 总线 ID 单独采集设置*/
	{ 0, 0 },           /*0x0117 其他CAN 总线 ID 单独采集设置*/
	{ 0, 0 },           /*0x0118 其他CAN 总线 ID 单独采集设置*/
	{ 0, 0 },           /*0x0119 其他CAN 总线 ID 单独采集设置*/
};

TERM_PARAM term_param =
{
	{ 0x11, 0x22, 0x33, 0x44, 0x55, 0x66 },
	{ "TCBBD" },
	{ "TW701-BD" },
	{ 0x00, 0x99, 0xaa, 0xbb, 0xcc, 0xdd, 0xee},
};

#define FLAG_DISABLE_REPORT_INVALID 1       /*设备非法*/
#define FLAG_DISABLE_REPORT_AREA	2       /*区域内禁止上报*/

static uint32_t flag_disable_report = 0;    /*禁止上报的标志位*/

/*保存参数到serialflash*/
void param_save( void )
{
	rt_kprintf( "parma_save size=%d\r\n", sizeof( jt808_param ) );
	sst25_write_back( ADDR_PARAM, (uint8_t*)&jt808_param, sizeof( jt808_param ) );
}

/*加载参数从serialflash*/
void param_load( void )
{
	/*预读一部分数据*/
	uint8_t		ver8[4];
	uint32_t	ver32;
	sst25_read( ADDR_PARAM, ver8, 4 );
	ver32 = ( ver8[0] ) | ( ver8[1] << 8 ) | ( ver8[2] << 16 ) | ( ver8[3]<<24 );
	rt_kprintf( "param_load ver=%08x\r\n", ver32 );
	if( jt808_param.id_0x0000 != ver32 ) /*不管是不是未初始化*/
	{
		rt_kprintf( "%s(%d)\r\n", __func__, __LINE__ );
		param_save( );
	}
	sst25_read( ADDR_PARAM, (uint8_t*)&jt808_param, sizeof( jt808_param ) );
}




#define TYPE_INT32	0x80		/*固定为4字节*/
#define TYPE_STR	0x40		/*固定为32字节*/
#define TYPE_CAN_ID 0x20		/*固定为8字节*/

