GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/applications/jt808.c
	va_start( args, fmt );
	length = vsnprintf( buf, sizeof( buf ), fmt, args );
	va_end( args );

	tx_seq++;
}

/*
   终端通用应答
 */
static void handle_jt808_tx_0x0001( uint16_t seq, uint16_t id, uint8_t res )
{
	uint8_t * pdata;
	JT808_TX_MSG_NODEDATA * pnodedata;
	uint8_t buf [64];
	uint8_t * p;
	uint16_t len;

	pnodedata = rt_malloc( sizeof( JT808_TX_MSG_NODEDATA ) );
	if( pnodedata == NULL )
	{
		return;
	}

	pnodedata->type		= TERMINAL_ACK;                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               /*发送即删除，其他不用配置*/
	pnodedata->state	= IDLE;

	len		= jt808_pack( buf, "\x00\x01\x00\x05%6s%w%w%w%b", term_param.mobile, tx_seq, seq, id, res );
	pdata	= rt_malloc( len );
	if( pdata == NULL )
	{
		rt_free( pnodedata );
		return;
	}
	memcpy( pdata, buf, len );
	pnodedata->msg_len	= len;
	pnodedata->pmsg		= pdata;
	msglist_append( list_jt808_tx, pnodedata );
	tx_seq++;
}

/*平台通用应答,收到信息，停止发送*/
static int handle_jt808_rx_0x8001( JT808_RX_MSG_NODEDATA * nodedata )
{
	MsgListNode * iter;
	JT808_TX_MSG_NODEDATA * iterdata;
	MsgListNode * iter_tmp;

	uint8_t * msg = nodedata->pmsg;
	uint16_t id;
	uint16_t seq;
	uint8_t res;

	seq = ( *msg << 8 ) | *( msg + 1 );
	id	= ( *( msg + 2 ) << 8 ) | *( msg + 3 );
	res = *( msg + 4 );

	/*逐条处理*/
	iter = list_jt808_tx->first;
	if( ( iterdata->head_id == id ) && ( iterdata->head_sn == seq ) )
	{
		iterdata->cb_tx_response( nodedata );
		iterdata->state = ACK_OK;
	}
}

/* 监控中心对终端注册消息的应答*/
static int handle_jt808_rx_0x8100( JT808_RX_MSG_NODEDATA * nodedata )
{
	MsgListNode * iter;
	JT808_TX_MSG_NODEDATA * iterdata;

	uint16_t ack_seq;
	uint8_t res;
	uint8_t * msg;

	msg		= nodedata->pmsg;
	ack_seq = ( *msg << 8 ) | *( msg + 1 );
	res		= *( msg + 2 );

	iter		= list_jt808_tx->first;
	iterdata	= iter->data;
	if( ( iterdata->head_id == 0x0100 ) && ( iterdata->head_sn == ack_seq ) )
	{
		rt_kprintf( "\r\n%s(%d)>res=%d\r\n", __func__, __LINE__, res );
		if( res == 0 )
		{
			strncpy( term_param.register_code, msg + 3, nodedata->msg_len );
			iterdata->state = ACK_OK;
		}
	}
	return 1;
}

/*设置终端参数*/
static int handle_jt808_rx_0x8103( JT808_RX_MSG_NODEDATA * nodedata )
{
	uint8_t * msg;
	uint8_t * p;

	uint8_t param_count;

	uint16_t msg_len, count = 0;

	uint32_t id;
	uint8_t len;

	msg			= nodedata->pmsg;
	msg_len		= nodedata->msg_len - 1;
	param_count = *msg;
	p			= msg + 1;
/*使用数据长度,判断数据是否结束，没有使用参数总数*/
	while( count < msg_len )
	{
		id		= ( ( *p++ ) << 24 ) | ( ( *p++ ) << 16 ) | ( ( *p++ ) << 8 ) | ( *p++ );
		len		= *p++;
		count	+= ( 5 + len );
		param_put(id,p);
	}
	return 1;
}

/*查询终端参数*/
static int handle_jt808_rx_0x8104( JT808_RX_MSG_NODEDATA * nodedata )
{
	return 1;
}

