GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/applications/jt808.c
/*终端控制*/
static int handle_jt808_rx_0x8105( JT808_RX_MSG_NODEDATA * nodedata )
{
	return 1;
}

/**/
static int handle_jt808_rx_0x8201( JT808_RX_MSG_NODEDATA * nodedata )
{
	return 1;
}

/**/
static int handle_jt808_rx_0x8202( JT808_RX_MSG_NODEDATA * nodedata )
{
	return 1;
}

/**/
static int handle_jt808_rx_0x8300( JT808_RX_MSG_NODEDATA * nodedata )
{
	return 1;
}

/**/
static int handle_jt808_rx_0x8301( JT808_RX_MSG_NODEDATA * nodedata )
{
	return 1;
}

/**/
static int handle_jt808_rx_0x8302( JT808_RX_MSG_NODEDATA * nodedata )
{
	return 1;
}

/**/
static int handle_jt808_rx_0x8303( JT808_RX_MSG_NODEDATA * nodedata )
{
	return 1;
}

/**/
static int handle_jt808_rx_0x8304( JT808_RX_MSG_NODEDATA * nodedata )
{
	return 1;
}

/**/
static int handle_jt808_rx_0x8400( JT808_RX_MSG_NODEDATA * nodedata )
{
	return 1;
}

/**/
static int handle_jt808_rx_0x8401( JT808_RX_MSG_NODEDATA * nodedata )
{
	return 1;
}

/**/
static int handle_jt808_rx_0x8500( JT808_RX_MSG_NODEDATA * nodedata )
{
	return 1;
}

/**/
static int handle_jt808_rx_0x8600( JT808_RX_MSG_NODEDATA * nodedata )
{
	return 1;
}

/**/
static int handle_jt808_rx_0x8601( JT808_RX_MSG_NODEDATA * nodedata )
{
	return 1;
}

/**/
static int handle_jt808_rx_0x8602( JT808_RX_MSG_NODEDATA * nodedata )
{
	return 1;
}

/**/
static int handle_jt808_rx_0x8603( JT808_RX_MSG_NODEDATA * nodedata )
{
	return 1;
}

/**/
static int handle_jt808_rx_0x8604( JT808_RX_MSG_NODEDATA * nodedata )
{
	return 1;
}

/**/
static int handle_jt808_rx_0x8605( JT808_RX_MSG_NODEDATA * nodedata )
{
	return 1;
}

/**/
static int handle_jt808_rx_0x8606( JT808_RX_MSG_NODEDATA * nodedata )
{
	return 1;
}

/**/
static int handle_jt808_rx_0x8607( JT808_RX_MSG_NODEDATA * nodedata )
{
	return 1;
}

/**/
static int handle_jt808_rx_0x8700( JT808_RX_MSG_NODEDATA * nodedata )
{
	return 1;
}

/**/
static int handle_jt808_rx_0x8701( JT808_RX_MSG_NODEDATA * nodedata )
{
	return 1;
}

/**/
static int handle_jt808_rx_0x8800( JT808_RX_MSG_NODEDATA * nodedata )
{
	return 1;
}

/**/
static int handle_jt808_rx_0x8801( JT808_RX_MSG_NODEDATA * nodedata )
{
	return 1;
}

/**/
static int handle_jt808_rx_0x8802( JT808_RX_MSG_NODEDATA * nodedata )
{
	return 1;
}

/**/
static int handle_jt808_rx_0x8803( JT808_RX_MSG_NODEDATA * nodedata )
{
	return 1;
}

/**/
static int handle_jt808_rx_0x8804( JT808_RX_MSG_NODEDATA * nodedata )
{
	return 1;
}

/**/
static int handle_jt808_rx_0x8805( JT808_RX_MSG_NODEDATA * nodedata )
{
	return 1;
}

/**/
static int handle_jt808_rx_0x8900( JT808_RX_MSG_NODEDATA * nodedata )
{
	return 1;
}

/**/
static int handle_jt808_rx_0x8A00( JT808_RX_MSG_NODEDATA * nodedata )
{
	return 1;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
static int handle_jt808_rx_default( JT808_RX_MSG_NODEDATA * nodedata )
{
	rt_kprintf( "\r\nunknown!\r\n" );
	return 1;
}

#define DECL_JT808_RX_HANDLE( a )	{ a, handle_jt808_rx_ ## a }
#define DECL_JT808_TX_HANDLE( a )	{ a, handle_jt808_tx_ ## a }

HANDLE_JT808_RX_MSG handle_jt808_rx_msg[] =
{
	DECL_JT808_RX_HANDLE( 0x8001 ),                                                                                                                                                                                                                 //	通用应答
	DECL_JT808_RX_HANDLE( 0x8100 ),                                                                                                                                                                                                                 //  监控中心对终端注册消息的应答
	DECL_JT808_RX_HANDLE( 0x8103 ),                                                                                                                                                                                                                 //	设置终端参数
	DECL_JT808_RX_HANDLE( 0x8104 ),                                                                                                                                                                                                                 //	查询终端参数
	DECL_JT808_RX_HANDLE( 0x8105 ),                                                                                                                                                                                                                 // 终端控制
	DECL_JT808_RX_HANDLE( 0x8201 ),                                                                                                                                                                                                                 // 位置信息查询    位置信息查询消息体为空
	DECL_JT808_RX_HANDLE( 0x8202 ),                                                                                                                                                                                                                 // 临时位置跟踪控制
	DECL_JT808_RX_HANDLE( 0x8300 ),                                                                                                                                                                                                                 //	文本信息下发
	DECL_JT808_RX_HANDLE( 0x8301 ),                                                                                                                                                                                                                 //	事件设置
	DECL_JT808_RX_HANDLE( 0x8302 ),                                                                                                                                                                                                                 // 提问下发
	DECL_JT808_RX_HANDLE( 0x8303 ),                                                                                                                                                                                                                 //	信息点播菜单设置
	DECL_JT808_RX_HANDLE( 0x8304 ),                                                                                                                                                                                                                 //	信息服务
	DECL_JT808_RX_HANDLE( 0x8400 ),                                                                                                                                                                                                                 //	电话回拨
	DECL_JT808_RX_HANDLE( 0x8401 ),                                                                                                                                                                                                                 //	设置电话本
	DECL_JT808_RX_HANDLE( 0x8500 ),                                                                                                                                                                                                                 //	车辆控制
	DECL_JT808_RX_HANDLE( 0x8600 ),                                                                                                                                                                                                                 //	设置圆形区域
	DECL_JT808_RX_HANDLE( 0x8601 ),                                                                                                                                                                                                                 //	删除圆形区域
	DECL_JT808_RX_HANDLE( 0x8602 ),                                                                                                                                                                                                                 //	设置矩形区域
	DECL_JT808_RX_HANDLE( 0x8603 ),                                                                                                                                                                                                                 //	删除矩形区域
	DECL_JT808_RX_HANDLE( 0x8604 ),                                                                                                                                                                                                                 //	多边形区域
	DECL_JT808_RX_HANDLE( 0x8605 ),                                                                                                                                                                                                                 //	删除多边区域
	DECL_JT808_RX_HANDLE( 0x8606 ),                                                                                                                                                                                                                 //	设置路线
	DECL_JT808_RX_HANDLE( 0x8607 ),                                                                                                                                                                                                                 //	删除路线
	DECL_JT808_RX_HANDLE( 0x8700 ),                                                                                                                                                                                                                 //	行车记录仪数据采集命令
	DECL_JT808_RX_HANDLE( 0x8701 ),                                                                                                                                                                                                                 //	行驶记录仪参数下传命令
	DECL_JT808_RX_HANDLE( 0x8800 ),                                                                                                                                                                                                                 //	多媒体数据上传应答
	DECL_JT808_RX_HANDLE( 0x8801 ),                                                                                                                                                                                                                 //	摄像头立即拍照
	DECL_JT808_RX_HANDLE( 0x8802 ),                                                                                                                                                                                                                 //	存储多媒体数据检索
	DECL_JT808_RX_HANDLE( 0x8803 ),                                                                                                                                                                                                                 //	存储多媒体数据上传命令
	DECL_JT808_RX_HANDLE( 0x8804 ),                                                                                                                                                                                                                 //	录音开始命令
	DECL_JT808_RX_HANDLE( 0x8805 ),                                                                                                                                                                                                                 //	单条存储多媒体数据检索上传命令 ---- 补充协议要求
	DECL_JT808_RX_HANDLE( 0x8900 ),                                                                                                                                                                                                                 //	数据下行透传
	DECL_JT808_RX_HANDLE( 0x8A00 ),                                                                                                                                                                                                                 //	平台RSA公钥
};


