GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/applications/jt808.c
/*
   判断一个字符串是不是表示ip的str
   如果由[0..9|.] 组成

   '.' 0x2e
   '/' 0x2f
   '0' 0x30
   '9' 0x39
   简化一下。不判断 '/'
 */
static uint8_t is_ipstr( char * str )
{
	char * p = str;
	while( *p != NULL )
	{
		if( ( *p > '9' ) || ( *p < '.' ) )
		{
			return 0;
		}
		p++;
	}
	return 1;
}

/*jt808的socket管理

   维护链路。会有不同的原因
   上报状态的维护
   1.尚未登网
   2.中心连接，DNS,超时不应答
   3.禁止上报，关闭模块的区域
   4.当前正在进行空中更新，多媒体上报等不需要打断的工作

 */
static void jt808_socket_proc( void )
{
	volatile uint32_t state;
	static rt_tick_t lasttick;
	static uint8_t flag_connect = 0;

	if( flag_disable_report )
	{
		return;
	}
/*检查GSM状态*/
	state = config_gsmstate( 0 );
	if( state == GSM_IDLE )
	{
		if( flag_connect == 0 )                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                              /*连接主server*/
		{
			curr_gsm_socket.apn		= jt808_param.id_0x0010;
			curr_gsm_socket.user	= jt808_param.id_0x0011;
			curr_gsm_socket.psw		= jt808_param.id_0x0012;
			curr_gsm_socket.type	= 't';
			if( is_ipstr( jt808_param.id_0x0013 ) )
			{
				strcpy( curr_gsm_socket.ip_str, jt808_param.id_0x0013 );
			} else
			{
				curr_gsm_socket.ip_domain = jt808_param.id_0x0013;
			}
			curr_gsm_socket.port = jt808_param.id_0x0018;
			rt_kprintf( "\r\napn=%s\r\n", curr_gsm_socket.apn );
		} else
		{
			curr_gsm_socket.apn		= jt808_param.id_0x0014;
			curr_gsm_socket.user	= jt808_param.id_0x0015;
			curr_gsm_socket.psw		= jt808_param.id_0x0016;
			curr_gsm_socket.type	= 't';
			if( is_ipstr( jt808_param.id_0x0017 ) )
			{
				strcpy( curr_gsm_socket.ip_str, jt808_param.id_0x0017 );
			} else
			{
				curr_gsm_socket.ip_domain = jt808_param.id_0x0017;
			}

